app/Livewire/Board.php

select * from `numbers`
select * from `games` where `active` = 1 limit 1
select count(*) as aggregate from `winners`
select count(*) as aggregate from `game_prize`
select `number_id` from `game_number` where `game_id` = 2
select * from `tickets` where `game_id` = 2
select count(*) as aggregate from `users` where `id` in ('', 2, 1)
select count(*) as aggregate from `tickets` where `game_id` = 2
select sum(`prize_amount`) as aggregate from `game_prize` where `game_id` = 2
---
    public function mount() {
        $this->user = Auth::user();
        $this->allNumbers = DB::table('numbers')->get();
        $this->activeGame = DB::table('games')->where('active', true)->first();
        $this->currentGameStatus = $this->activeGame->status;
        $this->noOfPrizes = DB::table('winners')->count();
        $this->noOfPrizeTypes = DB::table('game_prize')->count();

        $numbersCollection = DB::table('game_number')->where('game_id', $this->activeGame->id)->pluck('number_id');
        $this->drawnNumbers = Arr::prepend($this->drawnNumbers, $numbersCollection);
        $this->count = $numbersCollection->count();

        $this->noOfPlayers = DB::table('tickets')
            ->where('game_id', $this->activeGame->id)
            ->get()
            ->unique('user_id')
            ->count();

        // Get Logged in users
        $activeSessions = DB::table('sessions')->where('last_activity', '>', now()->subMinutes(5))->get();
        $loggedInUserIds = $activeSessions->pluck('user_id')->unique();
        $this->noOfLoggedInUsers = User::whereIn('id', $loggedInUserIds)->count();

        $this->noOfTicketsSold = DB::table('tickets')->where('game_id',  $this->activeGame->id)->count();
        $this->totalPrizeAmount = DB::table('game_prize')->where('game_id',  $this->activeGame->id)->sum('prize_amount');