app/Livewire/Claims.php

select * from `games` where `active` = 1 limit 1
select `claims`.`id` as `claim_id`, `claims`.`ticket_id`, `claims`.`game_prize_id`, `claims`.`status`, `claims`.`comment`, `claims`.`created_at`, `game_prize`.*, `tickets`.`object`, `users`.`name` as `user_name`, `prizes`.`name` as `prize_name` from `claims` inner join `game_prize` on `claims`.`game_prize_id` = `game_prize`.`prize_id` inner join `tickets` on `claims`.`ticket_id` = `tickets`.`id` inner join `users` on `tickets`.`user_id` = `users`.`id` inner join `games` on `tickets`.`game_id` = `games`.`id` inner join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` where `games`.`id` = 2 and `claims`.`status` = 'Open'
---
    public function mount() {
        $this->activeGame = DB::table('games')->where('active', true)->first();
        $this->user = Auth::user();

        // get all active claims for list view
        $this->claimsz = DB::table('claims')
            ->join('game_prize', 'claims.game_prize_id', '=', 'game_prize.prize_id')
            ->join('tickets', 'claims.ticket_id', '=', 'tickets.id')
            ->join('users', 'tickets.user_id', '=', 'users.id')
            ->join('games', 'tickets.game_id', '=', 'games.id')
            ->join('prizes', 'game_prize.prize_id', '=', 'prizes.id')
            ->where('games.id', '=', $this->activeGame->id)
            ->where('claims.status', '=', 'Open')
            ->select(
                'claims.id as claim_id',
                'claims.ticket_id',
                'claims.game_prize_id',
                'claims.status',
                'claims.comment',
                'claims.created_at',
                'game_prize.*',
                'tickets.object',
                'users.name as user_name',
                'prizes.name as prize_name',
            )
            ->get();

select `claims`.`id` as `claim_id`, `claims`.`ticket_id`, `claims`.`game_prize_id`, `claims`.`status`, `claims`.`comment`, `claims`.`created_at`, `game_prize`.*, `tickets`.`object`, `users`.`name` as `user_name`, `users`.`id` as `user_id`, `prizes`.`name` as `prize_name` from `claims` inner join `game_prize` on `claims`.`game_prize_id` = `game_prize`.`prize_id` inner join `tickets` on `claims`.`ticket_id` = `tickets`.`id` inner join `users` on `tickets`.`user_id` = `users`.`id` inner join `games` on `tickets`.`game_id` = `games`.`id` inner join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` left join `winners` on `claims`.`id` = `winners`.`claim_id` where `games`.`id` = 2 and `claims`.`id` = 3
---
    public function updateSelectedClaimWithDetails($claim_id) {
        // get details of the claim clicked
        $this->selectedClaimWithDetails = DB::table('claims')
            ->join('game_prize', 'claims.game_prize_id', '=', 'game_prize.prize_id')
            ->join('tickets', 'claims.ticket_id', '=', 'tickets.id')
            ->join('users', 'tickets.user_id', '=', 'users.id')
            ->join('games', 'tickets.game_id', '=', 'games.id')
            ->join('prizes', 'game_prize.prize_id', '=', 'prizes.id')
            ->leftJoin('winners', 'claims.id', '=', 'winners.claim_id')
            ->where('games.id', '=', $this->activeGame->id)
            ->where('claims.id', '=', $claim_id)
            ->select(
                'claims.id as claim_id',
                'claims.ticket_id',
                'claims.game_prize_id',
                'claims.status',
                'claims.comment',
                'claims.created_at',
                'game_prize.*',
                'tickets.object',
                'users.name as user_name',
                'users.id as user_id',
                'prizes.name as prize_name',
            )
            ->get();

select * from `claims` where `claims`.`id` = 1 limit 1
update `claims` set `status` = 'Winner', `is_winner` = 1, `claims`.`updated_at` = '2024-03-22 13:04:03' where `id` = 1
select * from `winners` where `game_prize_id` = 2 and `user_id` is null and `ticket_id` is null and `claim_id` is null limit 1
update `winners` set `user_id` = 2, `ticket_id` = 1, `claim_id` = 1, `winners`.`updated_at` = '2024-03-22 13:04:04' where `id` = 2
---
    public function updateClaimWinner($claim_id) {
        $claim = Claim::find($claim_id)
            ->update([
                'status' => 'Winner',
                'is_winner' => 1,
            ]);

        // on successful update fire an event
        if($claim) {
            event(new WinnerEvent([$this->selectedClaimWithDetails[0]->user_id, $this->selectedClaimWithDetails[0]]));
            $this->render();
        }
        // update winners table
        $winner = Winner::where('game_prize_id', $this->selectedClaimWithDetails[0]->game_prize_id)
                ->where('user_id', null)
                ->where('ticket_id', null)
                ->where('claim_id', null)
                ->first();

        if($winner) {
            $winner->update([
                'user_id' => $this->selectedClaimWithDetails[0]->user_id,
                'ticket_id' => $this->selectedClaimWithDetails[0]->ticket_id,
                'claim_id' => $this->selectedClaimWithDetails[0]->claim_id,
            ]);