app/Livewire/Numberz.php

select * from `games` where `active` = 1 limit 1
select `number_id` from `game_number` where `game_id` = 2
select `winners`.*, `game_prize`.`prize_amount` as `prize_amount`, `prizes`.`name` as `prize_name`, `users`.`name` as `user_name` from `winners` inner join `game_prize` on `winners`.`game_prize_id` = `game_prize`.`id` inner join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` left join `users` on `winners`.`user_id` = `users`.`id`
select * from `winners` inner join `game_prize` on `winners`.`game_prize_id` = `game_prize`.`id` inner join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` inner join `users` on `winners`.`user_id` = `users`.`id` where `user_id` is not null and `ticket_id` is not null and `claim_id` is not null
select `claims`.`id` as `claim_id`, `claims`.`ticket_id`, `claims`.`game_prize_id`, `claims`.`status`, `claims`.`comment`, `claims`.`created_at`, `game_prize`.*, `tickets`.`object`, `users`.`name` as `user_name`, `prizes`.`name` as `prize_name` from `claims` inner join `game_prize` on `claims`.`game_prize_id` = `game_prize`.`prize_id` inner join `tickets` on `claims`.`ticket_id` = `tickets`.`id` inner join `users` on `tickets`.`user_id` = `users`.`id` inner join `games` on `tickets`.`game_id` = `games`.`id` inner join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` where `games`.`id` = 2 and `claims`.`status` = 'Open'
select * from `claims` where `claims`.`ticket_id` in (1, 2)
select * from `tickets` where `tickets`.`user_id` in (2) and `game_id` = 2
---
    public function mount() {
        // notify()->success('Laravel Notify is awesome!');
        // Alert::toast('Success Title', 'Success Message from Numberz');
        Agora::make(id: 1)->uId(rand(999, 1999))->token();
        Agora::make(id: 1)->uId(rand(999, 1999))->join()->token();

        $this->user = Auth::user();
        $this->activeGame = DB::table('games')->where('active', true)->first();
        $this->currentGameStatus = $this->activeGame->status;

        $numbersCollection = DB::table('game_number')->where('game_id', 2)->pluck('number_id');
        $this->drawnNumbers = Arr::prepend($this->drawnNumbers, $numbersCollection);
        $this->count = $numbersCollection->count();

        // $this->gamePrizes = DB::table('game_prize')
        //             ->leftJoin('prizes', 'game_prize.prize_id', '=', 'prizes.id')
        //             ->where('game_prize.quantity', '>', '0')
        //             ->where('game_prize.game_id', '=', $this->activeGame->id)
        //             ->select('game_prize.*', 'prizes.name')
        //             ->get();

        $this->allPrizes = DB::table('winners')
                    ->join('game_prize', 'winners.game_prize_id', '=', 'game_prize.id')
                    ->join('prizes', 'game_prize.prize_id', '=', 'prizes.id')
                    ->leftJoin('users', 'winners.user_id', '=', 'users.id')
                    ->select(
                        'winners.*',
                        'game_prize.prize_amount as prize_amount',
                        'prizes.name as prize_name',
                        'users.name as user_name',
                    )
                    ->get();

        $this->allWinners = DB::table('winners')
                    ->join('game_prize', 'winners.game_prize_id', '=', 'game_prize.id')
                    ->join('prizes', 'game_prize.prize_id', '=', 'prizes.id')
                    ->join('users', 'winners.user_id', '=', 'users.id')
                    ->where('user_id', '!=', null)
                    ->where('ticket_id', '!=', null)
                    ->where('claim_id', '!=', null)
                    ->get();

        // dd($this->allPrizes);

        $this->activeClaims = DB::table('claims')
            ->join('game_prize', 'claims.game_prize_id', '=', 'game_prize.prize_id')
            ->join('tickets', 'claims.ticket_id', '=', 'tickets.id')
            ->join('users', 'tickets.user_id', '=', 'users.id')
            ->join('games', 'tickets.game_id', '=', 'games.id')
            ->join('prizes', 'game_prize.prize_id', '=', 'prizes.id')
            ->where('games.id', '=', $this->activeGame->id)
            ->where('claims.status', '=', 'Open')
            ->select(
                    'claims.id as claim_id',
                    'claims.ticket_id',
                    'claims.game_prize_id',
                    'claims.status',
                    'claims.comment',
                    'claims.created_at',
                    'game_prize.*',
                    'tickets.object',
                    'users.name as user_name',
                    'prizes.name as prize_name',
            )
            ->get();

        $this->tickets = Ticket::whereBelongsTo($this->user)
            ->where('game_id', '=', $this->activeGame->id)
            ->with('claims')
            ->get();