app/Livewire/Tickets.php

select * from `games` where `active` = 1 limit 1
select `game_prize`.*, `prizes`.`name` from `game_prize` left join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` where `game_prize`.`quantity` > '0' and `game_prize`.`game_id` = 2
select * from `claims` where `claims`.`ticket_id` in (1, 2)
select `winners`.*, `game_prize`.`prize_amount` as `prize_amount`, `prizes`.`name` as `prize_name`, `users`.`name` as `user_name` from `winners` inner join `game_prize` on `winners`.`game_prize_id` = `game_prize`.`id` inner join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` left join `users` on `winners`.`user_id` = `users`.`id` where `user_id` is null and `ticket_id` is null and `claim_id` is null
---
    public function mount() {
        // Alert::success('Success Title', 'Success Messagezzzzzzzzzzzzzzzzzzzzzzzzzzzz');


        $this->user = Auth::user();
        $this->autoMode = $this->user->automode;
        $this->activeGame = DB::table('games')->where('active', true)->first();
        $this->tickets = Ticket::whereBelongsTo($this->user)
            ->where('game_id', '=', $this->activeGame->id)
            ->with('claims')
            ->get();

        // initial tickets when but ticket first loads
        $table = new Table();
        $table->generate();
        $tickets = array_slice($table->getTickets(), 0, 2);
        $this->newTickets = json_encode($tickets);

        $this->gamePrizes = DB::table('game_prize')
            ->leftJoin('prizes', 'game_prize.prize_id', '=', 'prizes.id')
            ->where('game_prize.quantity', '>', '0')
            ->where('game_prize.game_id', '=', $this->activeGame->id)
            ->select('game_prize.*', 'prizes.name')
            ->get();

        $this->remainingPrizes = DB::table('winners')
            ->join('game_prize', 'winners.game_prize_id', '=', 'game_prize.id')
            ->join('prizes', 'game_prize.prize_id', '=', 'prizes.id')
            ->leftJoin('users', 'winners.user_id', '=', 'users.id')
            ->where('user_id', null)
            ->where('ticket_id', null)
            ->where('claim_id', null)
            ->select(
                'winners.*',
                'game_prize.prize_amount as prize_amount',
                'prizes.name as prize_name',
                'users.name as user_name',
            )
                ->get();

select * from `tickets` where `tickets`.`id` = 3 limit 1
---
    public function updateChecked() {
        $ticket_id = request()->input('ticket_id');
        $row = request()->input('row');
        $column = request()->input('column');

        $ticket = Ticket::find($ticket_id);

insert into `claims` (`ticket_id`, `game_prize_id`, `status`, `comment`, `updated_at`, `created_at`) values (3, '2', 'Open', 'Some comment here..', '2024-03-22 13:27:47', '2024-03-22 13:27:47')
update `games` set `status` = 'Paused' where `active` = 1
select `claims`.`id` as `claim_id`, `claims`.`ticket_id`, `claims`.`game_prize_id`, `claims`.`status`, `claims`.`comment`, `claims`.`created_at`, `game_prize`.*, `tickets`.`object` as `ticket`, `tickets`.`id` as `ticket_id`, `users`.`name` as `user_name`, `prizes`.`name` as `prize_name` from `claims` inner join `game_prize` on `claims`.`game_prize_id` = `game_prize`.`prize_id` inner join `tickets` on `claims`.`ticket_id` = `tickets`.`id` inner join `users` on `tickets`.`user_id` = `users`.`id` inner join `games` on `tickets`.`game_id` = `games`.`id` inner join `prizes` on `game_prize`.`prize_id` = `prizes`.`id` where `claims`.`id` = 3 and `games`.`id` = 2
---
    public function claimPrize() {
        if($this->hasClaim($this->ticketSelected))
            return Session::put('status', 'Already claimed using ticket number : '. $this->ticketSelected);


        $claim = Claim::create([
            'ticket_id'     => $this->ticketSelected,
            'game_prize_id' => $this->prizeSelected,
            'status'        => 'Open',
            'comment'       => 'Some comment here..'
        ]);

        //set active game status to 'Paused'
        DB::table('games')->where('active', true)->update(['status' => 'Paused']);

        //get active claims and fire event
        $newClaim = DB::table('claims')
            ->join('game_prize', 'claims.game_prize_id', '=', 'game_prize.prize_id')
            ->join('tickets', 'claims.ticket_id', '=', 'tickets.id')
            ->join('users', 'tickets.user_id', '=', 'users.id')
            ->join('games', 'tickets.game_id', '=', 'games.id')
            ->join('prizes', 'game_prize.prize_id', '=', 'prizes.id')
            ->where('claims.id', '=', $claim->id)
            ->where('games.id', '=', $this->activeGame->id)
            ->select(
                    'claims.id as claim_id',
                    'claims.ticket_id',
                    'claims.game_prize_id',
                    'claims.status',
                    'claims.comment',
                    'claims.created_at',
                    'game_prize.*',
                    'tickets.object as ticket',
                    'tickets.id as ticket_id',
                    'users.name as user_name',
                    'prizes.name as prize_name',
            )
            ->get();

select * from `game_prize` where `game_id` = 2 and `prize_id` = '2'
update `game_prize` set `quantity` = 2 where `game_id` = 2 and `prize_id` = '2'
---
        event(new ClaimEvent($newClaim));

        // get quantity of prize and decrement it
        $prizes = DB::table('game_prize')
            ->where('game_id', '=', $this->activeGame->id)
            ->where('prize_id', '=', $this->prizeSelected)
            ->get();
        $quantity = $prizes[0]->quantity;
        if($quantity > 0){
            $prizes = DB::table('game_prize')
                ->where('game_id', '=', $this->activeGame->id)
                ->where('prize_id', '=', $this->prizeSelected)
                ->update([
                    'quantity' => $quantity - 1,
                ]);

select * from `claims` where `ticket_id` = 3 and `status` = 'Open' limit 1
---
    public function hasClaim($ticketId) {
        $claim = Claim::where('ticket_id', $ticketId)->where('status', 'Open')->first();