app/Livewire/Video.php

    public function mount() {
        $this->user = Auth::user();
        $this->allUsers = User::all();
---
select * from `users`